
"use client";
import React from "react";
import { StickyScroll } from "./ui/sticky-scroll-reveal";

const mainContent = [
    {
      title: 'ၸဝ်ႈပိုတ်ႇၼႃႈပိုၼ်းပိတၵၢတ်ႈတႆး ၸဝ်ႈသြႃႇလူင် ပၺ်ၺႃၽေႃၵ မႁႃၼႃယၵ',
      description:
        'သြႃႇၸဝ်ႈလူင်ပၺ်ၺႃၽေႃးၵၼႆႉ ၵိူတ်ႇမႃးမိူဝ်ႈပီၵေႃးၸႃႇ 1254-ၼီႈ၊ လိူၼ်သီႇလွင်ႈ (1)ၶမ်ႈ၊ ဝၼ်းၽတ်း၊ ယၢမ်းၵၢင်ၼႂ်(9:30)မွင်း၊ တီႈဝၢၼ်ႈပႃႇၵႄႇ၊ ဢိူင်ႇမိူင်းၶၢင်၊ ၸေႈဝဵင်းမိူင်းသူႈ၊ ၶဝ်ႈပဵၼ်လုၵ်ႈ ၸၢႆး လုင်းၶမ်းယွတ်ႈ+ပႃႈၼၢင်းၶမ်း။ ၸိုဝ်ႈမိူဝ်းလဵၵ်ႉႁွင်ႉ ၸၢႆးပၢၼ်းၸိင်ႇ။ ',
      slug: '/docs/sao-maha-nayaka/the-most-ven-pannyaboga-monghsu',
      url: 'https://sattt.sgp1.cdn.digitaloceanspaces.com/files/978302a7b9651e27bcfa55419ebdf5ad.png'
    },
    {
      title: 'ၸဝ်ႈသြႃႇလူင် ပၼ်တိတ (ဢၷ်ၷမႁႃပၼ်တိတ) မႁႃၼႃယၵ မၢႆ(2) ဝတ်ႉမင်ႇၵလႃႇယၢၼ်ႇဢွင်ႇ ဝဵင်းမိူင်းၼွင်',
      description: 'ၸဝ်ႈသြႃႇလူင်ၼႆႉ ၵိူတ်ႇမႃးမိူဝ်ႈပီၵေႃးၸႃႇ 1274-ၼီႈ၊ လိူၼ်8မႂ်ႇ၊ 7 ၶမ်ႈ၊ ဝၼ်းၽတ်း ၊ တီႈဝၢၼ်ႈၶူဝ် ယၢဝ်း ဢိူင်ႇမိူင်းလိူၼ်း ၸေႈဝဵင်းတၢင်ႉယၢၼ်း ၼၼ်ႉယဝ်ႉ၊ဢူႈၸဝ်ႈၸိုဝ်ႈဝႃႈ လုင်းမွၵ်ႇၶမ်းၸၢႆး မႄႈၸဝ်ႈၸိုဝ်ႈ ဝႃႈ ပႃႈသႅင်သႃႇ။ မီးပီႈၼွင်ႉႁူမ်ႈၵၼ် (8)ၵေႃႉ၊ သြႃႇၸဝ်ႈပဵၼ်ၵေႃႉမၢႆ 7 ယဝ်ႉ။',
      slug: '/docs/sao-maha-nayaka/the-most-ven-pandita-mongnong',
      url: 'https://sattt.sgp1.cdn.digitaloceanspaces.com/files/1e94dc394df881731ea75b00a799a0c4.png'
    },
    {
      title: 'ၸဝ်ႈသြႃႇလူင် လႃၽဝမ်သ မႁႃႇၼႃႇယၵ မၢႆ(3) ၊ ၵျွင်းမင်ႇၵလႃႇၽူဝ်းတေႃႇ ဝဵင်းသီႇပေႃႉ',
      description: 'သြႃႇၸဝ်ႈလူင်ၼႆႉ ၵိူတ်ႇႁၼ်ၼႃႈမႃး မိူဝ်ႈပီ 1251 ၼီႈ၊ လိူၼ်သၢမ်မႂ်ႇ 3 ၶမ်ႈ ဝၼ်းပုတ်ႉ ၊ တီႈဝၢၼ်ႈၼမ်ႉ ပႃလၢင်း ဝဵင်းသီႇပေႃႉၼၼ်ႉယဝ်ႉ၊ ၸိုဝ်ႈပေႃႈမႄႈ ၸဝ်ႈဝႃႈ လုင်းယွတ်ႈ+ပႃႈယွတ်ႈၼႆႉယဝ်ႉ၊ ၸိုဝ်ႈမိူဝ်ႈလဵၵ်ႉႁွင်ႉဝႃႈ ၸၢႆးလူၼ်း ၼႆယဝ်ႉ။',
      slug: "/docs/sao-maha-nayaka/the-most-ven-laphawonsa-hsipaw",
      url: "https://sattt.sgp1.cdn.digitaloceanspaces.com/files/0b47dca70f0862a1a183f9f0ce104b99.png"
    },
    {
      title: 'ၸဝ်ႈသြႃႇလူင် ၺႃၼသမ်ၽႃရ (ဢၷ်ၷမႁႃပꧣ်တိတ) မႁႃႇၼႃယၵ မၢႆ (4)၊ ဝတ်ႉပိတၵၢတ်ႈ၊ ဝဵင်းပၢင်လူင်',
      description: 'ၸိုဝ်ႈပေႃႈ ပူႇလွႆၼွႆႉၶျေႇ ၸိုဝ်မႄႈ ပႃႈဢေးၼၢင်း၊ ၸႃႇတိ ဝၢၼ်ႈၼမ်ႉသၢႆး ပွၵ်ႉၽၢႆႇ တူၵ်းၵျွင်း၊ ဢိူင်ႇဝၢၼ်ႈႁၢတ်ႇ၊ တူင်ႇဝဵင်းၸဝ်ႈၾႃႉမွၵ်ႇမႆႇ၊ ၵိူတ်ႇမႃး မိူဝ်ႈပီၵေႃးၸႃႇ 1286-ၼီႈ၊ လိူၼ်သိပ်းဢဵတ်းလွင်ႈ 2-ၶမ်ႈ (14/10/1924) ဝၼ်းဢၢင်းၵၢၼ်း ၸိုဝ်ႈမိူဝ်ႈလဵၵ်ႉ ႁွင်ႉဝႃႈ ၸၢႆးထီး။ ပဵၼ်သၢင်ႇမိူဝ်ႈပီ 1300-ၼီႈ လိူၼ်သီလွင်ႈ 14 ၶမ်ႈ၊ (3/3/1939)၊ ပဵၼ်ၸၢင်း မိူဝ်ႈ1306 ၼီႈ၊ လိူၼ်သိပ်းသွင်မႂ်ႇ 8 ၶမ်ႈ၊ (23/10/1944)ၼၼ်ႉယဝ်ႉ။',
      slug: '/docs/sao-maha-nayaka/the-most-ven-nyanasamphara-panglong',
      url: "https://sattt.sgp1.cdn.digitaloceanspaces.com/files/32bd80f894cb4c9fd01bfc9bb2425ea4.png?updated_at=2024-03-23T13:42:40.666Z"
    },
  ];

function WhyChooseUs() {
  return (
    <div>
        <StickyScroll content={mainContent} />
    </div>
  )
}

export default WhyChooseUs